# Resumen SQL 2

## Insertar Datos en la Base de Datos

In [1]:
import pymysql

miConexion = pymysql.connect( host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
try:
    cur = miConexion.cursor()
    sql = "INSERT INTO usuario (nombre, apellidos, edad) VALUES ('Jose',\"Garcia\",30)"
    print(sql)
    cur.execute(sql)
    miConexion.commit()
    
    # Get the primary key value of the last inserted row
    print("Primary key id of the last inserted row: {}".format(cur.lastrowid))
    
except Exception as e:
    print("Exception occured:{}".format(e))
    
finally:
    miConexion.close()

INSERT INTO usuario (nombre, apellidos, edad) VALUES ('Jose',"Garcia",30)
Primary key id of the last inserted row: 6

## Actualizar Datos en la Base de Datos

In [2]:
import pymysql

miConexion = pymysql.connect( host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
try:
    cur = miConexion.cursor()
    sql = "UPDATE usuario SET edad=40"
    print(sql)
    cur.execute(sql)
    miConexion.commit()
    print(cur.rowcount, "registros afectado/s")
    
except Exception as e:
    print("Exception occured:{}".format(e))
    
finally:
    miConexion.close()

UPDATE usuario SET edad=40
2 registros afectado/s

## Eliminar Datos en la Base de Datos

In [3]:
import pymysql

miConexion = pymysql.connect( host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
try:
    cur = miConexion.cursor()
    sql = "DELETE FROM usuario WHERE id_usuario=1"
    print(sql)
    cur.execute(sql)
    miConexion.commit()
    print(cur.rowcount, "registros afectado/s")
    
except Exception as e:
    print("Exception occured:{}".format(e))
    
finally:
    miConexion.close()

DELETE FROM usuario WHERE id_usuario=1
0 registros afectado/s

## Seleccionar Datos en la Base de Datos

In [4]:
import pymysql

miConexion = pymysql.connect(host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
try:
    cur = miConexion.cursor()
    sql = "SELECT nombre, edad FROM usuario"
    print(sql)
    cur.execute(sql)
    miConexion.commit()
    rows = cur.fetchall();
    print(rows)
    
    for name, age in rows:
        print(name, age)
    
except Exception as e:
    print("Exception occured:{}".format(e))
    
finally:
    miConexion.close()

SELECT nombre, edad FROM usuario
(('Maria', 40), ('Ana', 40), ('Julio', 40), ('Sofia', 40), ('Jose', 40))
Maria 40
Ana 40
Julio 40
Sofia 40
Jose 40

In [5]:
import pymysql

miConexion = pymysql.connect( host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
try:
    cur = miConexion.cursor()
    sql = "SELECT * FROM usuario"
    print(sql)
    cur.execute(sql)
    miConexion.commit()
    rows = cur.fetchall()
 
    for pk, name, lastName, age in rows:
        print(pk, name, lastName, age)
    
except Exception as e:
    print("Exception occured:{}".format(e))
    
finally:
    miConexion.close()

SELECT * FROM usuario
2 Maria Garcia 40
3 Ana Garcia 40
4 Julio Garcia 40
5 Sofia Garcia 40
6 Jose Garcia 40

## Condicionales

In [6]:
import pymysql

miConexion = pymysql.connect( host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
try:
    cur = miConexion.cursor()
    sql = "SELECT nombre, edad FROM usuario WHERE edad > 22"
    print(sql)
    cur.execute(sql)
    miConexion.commit()
    rows = cur.fetchall();
    print(rows)
    
    for name, age in rows:
        print(name, age)
    
except Exception as e:
    print("Exception occured:{}".format(e))
    
finally:
    miConexion.close()

SELECT nombre, edad FROM usuario WHERE edad > 22
(('Maria', 40), ('Ana', 40), ('Julio', 40), ('Sofia', 40), ('Jose', 40))
Maria 40
Ana 40
Julio 40
Sofia 40
Jose 40

## Volcar Datos de un Dataframe a una Base de Datos

### 1.Cargamos los datos de un data frame a pandas

In [7]:
# Si no tiene instalado el modulo se instala: pip install sqlalchemy
from sqlalchemy import create_engine 
import pymysql
import pandas as pd

miConexion = pymysql.connect( host='localhost', user= 'root', 
                              password = "codenotch", db='data_analytics' )
alquiler = pd.read_csv('alquiler-madrid-distritos.csv')
alquiler.head()

      distrito   ano  quarter     precio
0   Arganzuela  2007        2  13.066587
1      Barajas  2007        2  11.199855
2  Carabanchel  2007        2  11.127661
3       Centro  2007        2  17.746404
4    Chamartín  2007        2  14.386480

### 2. Cargamos los datos desde pandas a la base de datos

In [8]:
db_data = "mysql+pymysql://root:codenotch@localhost:3306/data_analytics?charset=utf8mb4"
engine = create_engine(db_data)

alquiler.to_sql('alquiler', engine, if_exists='append', index=False)

840

## Leer los datos de la BBDD y volcarlos en un Dataframe

In [9]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

db_data = "mysql+pymysql://root:codenotch@localhost:3306/data_analytics?charset=utf8mb4"
engine = create_engine(db_data)
sql = "SELECT * FROM alquiler WHERE distrito = \"Retiro\" AND ano BETWEEN 2012 AND 2014"
distrito = pd.read_sql(sql,engine)
distrito.head()

  distrito   ano  quarter     precio
0   Retiro  2012        1  12.601891
1   Retiro  2012        2  12.363832
2   Retiro  2012        3  12.167435
3   Retiro  2012        4  11.951317
4   Retiro  2013        1  11.431686

## Como insertar muchos datos en formato lista

In [ ]:
import sqlite3
import os

miConexion = pymysql.connect( host='localhost', user= 'root', password='administrador', db='escuela')
cur = miConexion.cursor()


estudiantes= [('Juanito', 'Perez',2)]
cur.executemany('INSERT INTO students(first_name, last_name, FK_group_student) VALUES(%s,%s,%s)',estudiantes)
miConexion.commit()